app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "s"], ["body", "xdd"], ["user_id", 14], ["created_at", "2020-02-08 08:31:55.997207"], ["updated_at", "2020-02-08 08:31:55.997207"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id

    if @book.save
       flash[:notice] = "You have creatad book successfully."
       redirect_to book_path(@book)
    else
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def update
    @book = Book.find(params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 8]]
---
   def destroy
        book = Book.find(params[:id])
        book.destroy

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def correct_user
  book = Book.find(params[:id])