app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "aaaaaaaaaaaaa"], ["user_id", 1], ["book_id", 1], ["created_at", "2020-03-09 12:51:33.728872"], ["updated_at", "2020-03-09 12:51:33.728872"]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
def create
	 @book = Book.find(params[:book_id])
	 @comment = BookComment.new(book_comment_params)
	 @comment.user_id = current_user.id
	 @comment.book_id = @book.id
	 if @comment.save
	 redirect_to book_path(book)
	else
     @book.book_comments = BookComment.where(book_id: @book.id)