app/controllers/relationships_controller.rb

INSERT INTO "relationships" ("follower_id", "following_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 1], ["following_id", 2], ["created_at", "2020-03-11 11:50:57.556200"], ["updated_at", "2020-03-11 11:50:57.556200"]]
---
  def create
    # user = User.find(following_id: params[:user_id])
    follow = current_user.active_relationships.new(follower_id: params[:user_id])
    follow.save

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 20]]
---
  def destroy
    # user = User.find(following: params[:user_id])
    follow = current_user.active_relationships.find_by(follower_id: params[:user_id])
    follow.destroy