app/controllers/search_controller.rb

SELECT "books".* FROM "books" WHERE "books"."title" = ?  [["title", "ka"]]
---
  def match(model,content)
    if model == 'user'
    User.where(name: content)
  else model == 'book'
    Book.where(title: content)