app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", nil], ["updated_at", "2020-02-08 08:35:19.869835"], ["id", 14]]
---
  def update
     @user = User.find(params[:id])
      if @user.update(user_params)

SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def index
    @users = User.all
    @book = Book.new
    @user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def followers
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def followings
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def correct_user
  user = User.find(params[:id])